from aiogram.types import InputFile

sigma14_24_cap = ("Оптическая конструкция объектива SIGMA 14-24mm F2.8 DG HSM | Art включает в себя 3 "
                  "элемента из FLD стекла, 3 элемента из SLD стекла, а также 3 асферических элемента, "
                  "что минимизирует поперечные хроматические аберрации, а также другие виды оптических "
                  "искажения, обеспечивая великолепное качество изображения на всём диапазоне фокусных "
                  "расстояний от 14 до 24мм.")
sigma14_24_ph = "Images\Sigma\sigma14-24mm.jpg"

sigma50_cap = ("SIGMA 50mm F1.4 DG HSM Art — это полнокадровый светосильный фикс, который на открытой"
               " диафрагме дает такую резкость, которая многим его конкурентам не снилась. Это настоящий "
               "шедевр оптики, олицетворяющий собой победу современных технологий над всеми возможными искажениями.")

sigma18_35_cap = ("Объектив SIGMA 18-35mm f/1.8 DC HSM | Art — сверхсветосильный стандартный объектив с "
                  "переменным фокусным растоянием предназначен только для цифровых зеркальных камер формата "
                  "APS-C/DX.\n\n"
                  "Оптическая схема объектива SIGMA 18-35mm f/1.8 DC HSM | Art состоит из 17 элементов в 12 "
                  "группах, в том числе 4 литых асферических элемента и 5 элементов из SLD стекла со сверхнизкой "
                  "дисперсией. Многослойное покрытие Super позволяет уменьшить ореолы с бликами и обеспечивает "
                  "высокий контраст даже при контровой засветке.")

fuji_xt3_cap = ("-боди: $1099\n"
                "-с китовым объективом 18-55mm: $1499")

fuji_xt4_cap = ("-body - $1699\n"
                "-kit 18-55mm - $2099")

fuji_xf35_cap = ("")
fuji_xf33_cap = ("")

manf_PV_610_cap = ("Универсальный, практичный и крепкий.\n\n"
                   "Рюкзак Pro Light PV-610 от Manfrotto для камкордеров, DSLR-камер или видео-ригов – "
                   "идеальное решение для профессионалов.\n\n"
                   "Легкий, компактный, но вместительный во всех необходимых пространствах – вы можете "
                   "поместить в него внушительное количество оборудования. Он легко выдержит набор для "
                   "видеокамеры, DSLR-камеру и видео-риг. «Стройная» обтекаемая форма позволяет вам получить "
                   "доступ к вашему снаряжению спереди, так что вы сможете мгновенно достать свою камеру в "
                   "нужной ситуации. Этот рюкзак для камеры оснащен системой защиты камеры Manfrotto Camera "
                   "Protection System (CPS), поэтому вы можете быть уверены, что все внутри находится в целости "
                   "и сохранности.")