

sigma14_24_cap = ("Оптическая конструкция объектива SIGMA 14-24mm F2.8 DG HSM | Art включает в себя 3 "
                  "элемента из FLD стекла, 3 элемента из SLD стекла, а также 3 асферических элемента, "
                  "что минимизирует поперечные хроматические аберрации, а также другие виды оптических "
                  "искажения, обеспечивая великолепное качество изображения на всём диапазоне фокусных "
                  "расстояний от 14 до 24мм.")
sigma50_cap = ("SIGMA 50mm F1.4 DG HSM Art — это полнокадровый светосильный фикс, который на открытой"
               " диафрагме дает такую резкость, которая многим его конкурентам не снилась. Это настоящий "
               "шедевр оптики, олицетворяющий собой победу современных технологий над всеми возможными искажениями.")
